def input_correct_num():
    """
    Функция реализующая ввод пользователем корректного числа входящего в заданный диапазон.
    """
    pass


def ui_array_init():
    """
    Функция для инициализации массива числами вручную.
    """
    pass


def auto_array_init():
    """
    Функция для инициализации массива случайными числами.
    """
    pass


def ui_array_of_dots_init():
    """
    Функция для инициализации массива точек вручную.
    """
    pass


def ui_auto_array_of_dots_init():
    """
    Функция для инициализации массива случайными точками.
    """
    pass
