def number_of_common_numbers():
    """
    Функция находит количество общих чисел в двух массивах.
    Также, число считается общим если оно входит в один массив, а в другом
    находится его перевернутая версия.
    """
    pass


def distance_between_points():
    """
    Функция поиска точек расстояние между которыми больше заданного.
    """
    pass


def segment_length():
    """
    Функция вычисляющая длину отрезка образованного двумя точками.
    """
    pass


def arithmetic_conversion():
    """
    Функция реализующая решение следующей задачи:
    Требуется проверить можно ли получить число из 3-го массива, арифметическими преобразованиями
    с числами двух других массивов. Числа проверяются последовательно.
    """
    pass


def check_arithmetic_operation():
    """
    Функция реализующая проверку: можно ли получить число из 3-го массива, заданным арифметическим преобразованием
    с числами 2-ух других массивов. В случае положительного результата добавляет полученый способ в список результатов.
    """
    pass
